Revit 2023 API
RebarFreeFormAccessor Properties
The RebarFreeFormAccessor type exposes the following members.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
RebarStyle
 Identifies the RebarStyle of the current Rebar element.
StirrupTieAttachmentType
 Identifies the StirrupTieAttachmentType of the current Rebar element. The RebarStyle of the Rebar element must be StirrupTie.
WorkshopInstructions
 Identifies the workshop instructions of the current Rebar element.
See Also
RebarFreeFormAccessor Class
Autodesk.Revit.DB.Structure Namespace